Configuration/src/Documents/Services/Services.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Services</name>
  <registerRecords>AccumulationRegister.BalanceOfMaterials</registerRecords>
  <registerRecords>AccumulationRegister.Sales</registerRecords>
  <registerRecords>AccumulationRegister.CostOfMaterials</registerRecords>
  <registerRecords>AccountingRegister.Primary</registerRecords>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouse</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Customers</types>
    </type>
  </attributes>
  <attributes>
    <name>Technician</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <tabularSections>
    <name>MaterialsAndServices</name>
    <attributes>
      <name>MaterialOrService</name>
      <type>
        <types>CatalogRef.MaterialsAndServices</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PropertySet</name>
      <type>
        <types>CatalogRef.MaterialOptions</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Configuration/src/AccumulationRegisters/BalanceOfMaterials/BalanceOfMaterials.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>BalanceOfMaterials</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Material</name>
    <type>
      <types>CatalogRef.MaterialsAndServices</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouse</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PropertySet</name>
    <type>
      <types>CatalogRef.MaterialOptions</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Configuration/src/AccumulationRegisters/CostOfMaterials/CostOfMaterials.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>CostOfMaterials</name>
  <resources>
    <name>Cost</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Material</name>
    <type>
      <types>CatalogRef.MaterialsAndServices</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Configuration/src/AccumulationRegisters/Sales/Sales.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Sales</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Revenue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Cost</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>MaterialOrService</name>
    <type>
      <types>CatalogRef.MaterialsAndServices</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Customers</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Technician</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Configuration/src/AccountingRegisters/Primary/Primary.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Primary</name>
  <chartOfAccounts>ChartOfAccounts.Main</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Sum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Main.AccountingFlag.Quantitative</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Main.ExtDimensionAccountingFlag.Quantitative</extDimensionAccountingFlag>
  </resources>
</mdclass:AccountingRegister>

Configuration/src/Enums/MaterialServiceTypes/MaterialServiceTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>MaterialServiceTypes</name>
  <enumValues>
    <name>Material</name>
  </enumValues>
  <enumValues>
    <name>Service</name>
  </enumValues>
</mdclass:Enum>

Configuration/src/ChartsOfAccounts/Main/Main.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Main</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ExtraDimensionTypes</extDimensionTypes>
  <predefined>
    <items>
      <name>AccountsReceivable</name>
      <description>Accounts receivable</description>
      <code>2000</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>AccountsPayable</name>
      <description>Accounts payable</description>
      <code>4000</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Inventory</name>
      <description>Inventory</description>
      <code>5000</code>
    </items>
    <items>
      <name>Income</name>
      <description>Income</description>
      <code>9000</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
  <accountingFlags>
    <name>Quantitative</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Quantitative</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Configuration/src/ChartsOfCharacteristicTypes/ExtraDimensionTypes/ExtraDimensionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ExtraDimensionTypes</name>
  <type>
    <types>CatalogRef.ExtraDimensions</types>
    <types>CatalogRef.Customers</types>
    <types>CatalogRef.MaterialsAndServices</types>
  </type>
  <predefined>
    <items>
      <name>Customers</name>
      <description>Customers</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Customers</types>
      </type>
    </items>
    <items>
      <name>Materials</name>
      <description>Materials</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.MaterialsAndServices</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Configuration/src/Documents/Services/ObjectModule.bsl
Procedure Posting(Cancel, Mode)
	RegisterRecords.BalanceOfMaterials.Write = True; 
	RegisterRecords.CostOfMaterials.Write = True;    
	RegisterRecords.Sales.Write = True;   
	RegisterRecords.Primary.Write = True;
	
	
	// Creating temporary tables manager
	TTManager = New TempTablesManager;    
	#Region DocumentMaterialAndServices
	Query = New Query;
	// Specifying the temporary tables manager used by the query
	Query.TempTablesManager = TTManager;    
	
	Query.Text = 
	"SELECT
	|	ServicesMaterialsAndServices.MaterialOrService AS MaterialOrService,
	|	ServicesMaterialsAndServices.MaterialOrService.MaterialServiceType AS MaterialServiceType,
	|	SUM(ServicesMaterialsAndServices.Quantity) AS QuantityInDocument,
	|	SUM(ServicesMaterialsAndServices.Total) AS TotalInDocument,
	|	ServicesMaterialsAndServices.PropertySet AS PropertySet
	|INTO DocumentMaterialsAndServices
	|FROM
	|	Document.Services.MaterialsAndServices AS ServicesMaterialsAndServices
	|WHERE
	|	ServicesMaterialsAndServices.Ref = &Ref
	|
	|GROUP BY
	|	ServicesMaterialsAndServices.MaterialOrService,
	|	ServicesMaterialsAndServices.MaterialOrService.MaterialServiceType,
	|	ServicesMaterialsAndServices.PropertySet";
	
	Query.SetParameter("Ref", Ref);
	
	QueryResult = Query.Execute(); 
	#EndRegion
	#Region RegisterRecords
	Query2 = New Query;
	Query2.TempTablesManager = TTManager;
	Query2.Text = "SELECT
	|	DocumentMaterialsAndServices.MaterialOrService AS MaterialOrService,
	|	DocumentMaterialsAndServices.MaterialServiceType AS MaterialServiceType,
	|	DocumentMaterialsAndServices.QuantityInDocument AS QuantityInDocument,
	|	DocumentMaterialsAndServices.TotalInDocument AS TotalInDocument,
	|	ISNULL(CostOfMaterialsBalance.CostBalance, 0) AS Cost,
	|	ISNULL(BalanceOfMaterialsBalance.QuantityBalance, 0) AS Quantity,
	|	DocumentMaterialsAndServices.PropertySet AS PropertySet
	|FROM
	|	DocumentMaterialsAndServices AS DocumentMaterialsAndServices
	|		LEFT JOIN AccumulationRegister.CostOfMaterials.Balance(
	|				,
	|				Material IN
	|					(SELECT
	|						DocumentMaterialsAndServices.MaterialOrService
	|					FROM
	|						DocumentMaterialsAndServices)) AS CostOfMaterialsBalance
	|		ON DocumentMaterialsAndServices.MaterialOrService = CostOfMaterialsBalance.Material
	|		LEFT JOIN AccumulationRegister.BalanceOfMaterials.Balance(
	|				,
	|				Material IN
	|					(SELECT
	|						DocumentMaterialsAndServices.MaterialOrService
	|					FROM
	|						DocumentMaterialsAndServices)) AS BalanceOfMaterialsBalance
	|		ON DocumentMaterialsAndServices.MaterialOrService = BalanceOfMaterialsBalance.Material";
	
	
	// Setting data locks for the CostOfMaterials and BalanceOfMaterials registers
	RegisterRecords.CostOfMaterials.LockForUpdate = True;
	RegisterRecords.BalanceOfMaterials.LockForUpdate = True;
	// Writing empty record sets to read balances without the data added by this document
	RegisterRecords.CostOfMaterials.Write();
	RegisterRecords.BalanceOfMaterials.Write();
	
	QueryResult = Query2.Execute();     
	VT = QueryResult.Unload();
	SelectionDetailRecords = QueryResult.Select();
	
	While SelectionDetailRecords.Next() Do   
		If SelectionDetailRecords.Quantity = 0 Then
			MaterialCost = 0;
		Else
			MaterialCost = SelectionDetailRecords.Cost / SelectionDetailRecords.Quantity;
		EndIf;
		If SelectionDetailRecords.MaterialServiceType = Enums.MaterialServiceTypes.Material Then    
			// register BalanceOfMaterials Expense
			
			Record = RegisterRecords.BalanceOfMaterials.Add();
			Record.RecordType = AccumulationRecordType.Expense;
			Record.Period = Date;
			Record.Material = SelectionDetailRecords.MaterialOrService;
			Record.Warehouse = Warehouse;
			Record.Quantity = SelectionDetailRecords.QuantityInDocument;   
			Record.PropertySet = SelectionDetailRecords.PropertySet;
			
			
			// register CostOfMaterials Expense
			
			Record = RegisterRecords.CostOfMaterials.Add();
			Record.RecordType = AccumulationRecordType.Expense;
			Record.Period = Date;
			Record.Material = SelectionDetailRecords.MaterialOrService;
			Record.Cost = SelectionDetailRecords.QuantityInDocument * MaterialCost;        
			
			// register Primary
			// First posting: Dr 2000 (AccountsReceivable) – Cr 9000 (Income)
			// Total
			Record = RegisterRecords.Primary.Add();
			Record.AccountDr = ChartsOfAccounts.Main.AccountsReceivable;
			Record.AccountCr = ChartsOfAccounts.Main.Income;
			Record.Period = Date;
			Record.Sum = SelectionDetailRecords.TotalInDocument;
			Record.ExtDimensionsDr[ChartsOfCharacteristicTypes.
			ExtraDimensionTypes.Customers] = Customer;
			// Second posting: Dr 9000 (Income) – Cr 5000 (Inventory) Cost
			Record = RegisterRecords.Primary.Add();
			Record.AccountDr = ChartsOfAccounts.Main.Income;
			Record.AccountCr = ChartsOfAccounts.Main.Inventory;
			Record.Period = Date;
			Record.Sum = MaterialCost * SelectionDetailRecords.QuantityInDocument;
			Record.QuantityCr = SelectionDetailRecords.QuantityInDocument;
			Record.ExtDimensionsCr[ChartsOfCharacteristicTypes.ExtraDimensionTypes.Materials] = SelectionDetailRecords.MaterialOrservice;
		EndIf;   
		// register Sales
		Record = RegisterRecords.Sales.Add();
		Record.Period = Date;
		Record.MaterialOrService =
		SelectionDetailRecords.MaterialOrService;
		Record.Customer = Customer;
		Record.Technician = Technician;
		Record.Quantity = SelectionDetailRecords.QuantityInDocument;
		Record.Revenue = SelectionDetailRecords.TotalInDocument;
		Record.Cost = SelectionDetailRecords.QuantityInDocument
		* MaterialCost;
	EndDo;            
	
	RegisterRecords.Write();
	#EndRegion
	#Region BalanceCheck
	
	If Mode = DocumentPostingMode.RealTime Then
		Query3 = New Query;
		Query3.TempTablesManager = TTManager;
		Query3.Text = "SELECT
		|	BalanceOfMaterialsBalance.Material AS Material,
		|	BalanceOfMaterialsBalance.QuantityBalance AS QuantityBalance,
		|	BalanceOfMaterialsBalance.PropertySet AS PropertySet
		|FROM
		|	AccumulationRegister.BalanceOfMaterials.Balance(
		|			,
		|			Material IN
		|					(SELECT
		|						DocumentMaterialsAndServices.MaterialOrService
		|					FROM
		|						DocumentMaterialsAndServices)
		|				AND Warehouse = &Warehouse) AS BalanceOfMaterialsBalance
		|WHERE
		|	BalanceOfMaterialsBalance.QuantityBalance < 0";   
		Query3.SetParameter("Warehouse", Warehouse);
		QueryResult = Query3.Execute();
		SelectionDetailRecords = QueryResult.Select();  
		While SelectionDetailRecords.Next() Do
			Message = New UserMessage();
			Message.Text = String(- SelectionDetailRecords.QuantityBalance)
			+ " units shortage for """ + SelectionDetailRecords.Material
			+ """ with """ + SelectionDetailRecords.PropertySet
			+ """ property set.";  
			Message.Message();
			
			Cancel = True;
		EndDo;
	EndIf;
	
	#EndRegion
	
EndProcedure

Procedure OnSetNewNumber(StandardProcessing, Prefix)
	Prefix = Exchange.GetNumberingPrefix();
EndProcedure
